SYMBOLS = [
    "[", "\\", "]", "^", "_", "`", "<", ">", "*",
    "1","2","3","4","5","6","7","8","9","0",
    "{{1.}}","{{2.}}","{{3.}}","{{4.}}","{{5.}}","{{67.}}",
    "⌦","€","ƒ","„","…","†","‡","ˆ","‰","Š","‹","Œ","Ž",
    "‘","’","“","”","•","–","—","˜","™","š","›","œ","ž","Ÿ",
    "¡","¢","£","¤","¥","¦","§","¨","©","ª","«","¬","®","¯",
    "°","±","²","³","´","µ","¶","·","¸","¹","º","»","¼","½",
    "¾","¿","À","Á","Â","Ã","Ä","Å","Æ","Ç","È","É","Ê","Ë",
    "Ì","Í","Î","Ï","Ð","Ñ","Ò","Ó","Ô","Õ","Ö","×","Ø","Ù",
    "Ú","Û","Ü","Ý","Þ","ß","à","á","â","ã","ä","å","æ","ç",
    "è","é","ê","ë","ì","í","î","ï","ð","ñ","ò","ó","ô","õ",
    "ö","÷","ø","ù","ú","û","ü","ý","þ","ÿ"
]

def generate_ids(symbols):
    ids = {}
    for i, symbol in enumerate(symbols):
        if i < 10:
            ids[symbol] = f"{i}"
        elif i < 100:
            ids[symbol] = f"{i:02d}"
        elif i < 1000:
            ids[symbol] = f"{i:03d}"
        else:
            ids[symbol] = f"{i:04d}"
    return ids

ids = generate_ids(SYMBOLS)

for k, v in ids.items():
    print(v, "->", k)
    
def MakeJson(table):
    # sry for late
